from aiogram import F, Router
from aiogram.types import Message

contacts_router = Router()


contacts_reply_msg = """
Для замовлення  та резервування необхідних позицій, будь ласка, надішліть запит менеджеру 👉 t.me/rent4djmanager у такому форматі:

Позиція з прайсу + кількість
(обовʼязково скопіювати й вставити точну назву позиції з каталогу)
Приклад:
L-ACOUSTICS Syva [LF: 6 × 5", HF: 3 × 1.75"] — 2 шт

-Дата та час забору обладнання
-Дати роботи
-Дата та час повернення обладнання

📍 Графік роботи складу:
11:00–18:00 щоденно.
Перед виїздом, будь ласка, повідомляйте за 1 годину.
- видача/повернення/доставка в неробочий час, оплачується додатково. 

🚚 Якщо потрібна доставка, додатково вкажіть:

-дату та час доставки
-адресу
-контактний номер телефону відповідальної особи на місці

📄 Каталог обладнання:
https://docs.google.com/spreadsheets/d/1ez7Ur5YD0AiTtN2QEWcgZyhlqLGAA6gln0BgTcbBDqM/edit?gid=0#gid=0

📍 Геолокація складу:
https://maps.app.goo.gl/Qxrg4aTEkYYxN4Ti8

❗️ При відправці обладнання курʼєром прохання вказувати виключно цю геолокацію.
"""


@contacts_router.message(F.text.lower() == "contacts/help")
async def cmd_contacts(message: Message):
    await message.answer(contacts_reply_msg)
